2018/python-coding.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-05 周六 16:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 编码问题</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 编码问题</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc67a99e">1. Unicode &amp; UTF-8</a></li>
<li><a href="#org9cf51fc">2. 编码格式转化</a></li>
<li><a href="#org0974b10">3. Python2</a></li>
<li><a href="#org126bb13">4. Python3</a></li>
<li><a href="#org90ac413">5. 编写程序</a></li>
<li><a href="#orge7f8db2">6. 代码样例</a></li>
<li><a href="#org75cabab">7. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc67a99e" class="outline-2">
<h2 id="orgc67a99e"><span class="section-number-2">1</span> Unicode &amp; UTF-8</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
<code>Unicode</code>, 一个字符集， 将世界上所有的字符都纳入其中， 并给予每一个字符
一个独一无二的编码。
</p>

<p>
表示方式： <code>U+XXXX</code>, <code>X</code> 代表一个十六进制数字。
</p>

<p>
<b>注：</b> <code>Unicode</code> 只是一个字符集， 只规定了一个字符的二进制编码， 没有规定这个二进制编码
的储存方式。
</p></li>

<li><code>UTF-8</code>, <code>Unicode</code> 的 <b>一种</b> 实现方式， 规定了二进制编码的储存方式， 可以由计算机识别。</li>
</ul>

<p>
<b>PS:</b> 不同的编码方式对同一字符的编码很有可能是不一样的， 所以按照错误的编码方式
显示数据时， 会导致乱码。
</p>
</div>
</div>

<div id="outline-container-org9cf51fc" class="outline-2">
<h2 id="org9cf51fc"><span class="section-number-2">2</span> 编码格式转化</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>目前存在有很多种编码方式， 如 <code>UTF-8</code>, <code>cp936</code> 等</li>
<li>很多编码方式都向下兼容 <code>ASCII</code></li>
<li>不同编码方式在其他字符的表示上很可能不兼容</li>
<li>我们可以用 <code>Unicode</code> 来映射不同字符集中的字符编码</li>
<li>因此， 我们可以将一个编码方式 <b>解码</b> 为 <code>Unicode</code>, 对应 <code>Python</code> 的 <code>decode()</code></li>
<li>然后， 通过 <code>Unicode</code> 映射出另一编码方式中的字符的编码， 对应 <code>Python</code> 的 <code>encode()</code></li>
</ol>
</div>
</div>

<div id="outline-container-org0974b10" class="outline-2">
<h2 id="org0974b10"><span class="section-number-2">3</span> Python2</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>Python2</code> 中的两种字符串数据类型：
</p>
<ul class="org-ul">
<li><code>str</code>, 存储 <code>bytes</code>, 对应编码方式中 <b>二进制编码</b> 的存储格式</li>
<li><code>unicode</code>, 存储 <code>Unicode</code> 编码， 如: <code>u'\u7f16\u7801'</code> 对应 <code>U+7F16</code> - 编， <code>U+7801</code> - 码</li>
</ul>

<p>
<b>注:</b> 类似 <code>u'abcd'</code> 的字符串是一个 <code>Unicode</code> 对象， 之前我一直认为还是 <code>str</code>.
</p>

<p>
两者的转化方式为：
</p>
<pre class="example">
str -&gt; decode -&gt; unicode
unicode -&gt; encode -&gt; str
</pre>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'&#32534;&#30721;'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">type</span>(s)
&lt;<span style="font-weight: bold;">type</span> <span style="font-style: italic;">'str'</span>&gt;
&gt;&gt;&gt; s.decode(<span style="font-style: italic;">'cp936'</span>)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#35299;&#30721;</span>
u<span style="font-style: italic;">'\u7f16\u7801'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">type</span>(s.decode(<span style="font-style: italic;">'cp936'</span>))
&lt;<span style="font-weight: bold;">type</span> <span style="font-style: italic;">'unicode'</span>&gt;
&gt;&gt;&gt; u<span style="font-style: italic;">'&#32534;&#30721;'</span>
u<span style="font-style: italic;">'\u7f16\u7801'</span>
&gt;&gt;&gt; u<span style="font-style: italic;">'&#32534;&#30721;'</span>.encode(<span style="font-style: italic;">'cp936'</span>)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#32534;&#30721;</span>
<span style="font-style: italic;">'\xb1\xe0\xc2\xeb'</span>
</pre>
</div>

<p>
<code>Python2</code> 中， 组合 <code>str</code> 和 <code>unicode</code> 对象的时候， 会自动尝试将 <code>str</code> 解码为 <code>unicode</code>, 解码中使用的
字符集的值与 <code>sys.getdefaultencoding()</code> 的值相等。
</p>

<p>
然而， 这个值通常为 <code>ascii</code>, 如果你的 <code>str</code> 中包含非 <code>str</code> 字符的话， 就会出现 <code>UnicodeDecodeError</code>
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; u<span style="font-style: italic;">'abc'</span> + <span style="font-style: italic;">'def'</span>
u<span style="font-style: italic;">'abcdef'</span>
&gt;&gt;&gt; u<span style="font-style: italic;">'abc'</span> + <span style="font-style: italic;">'&#32534;&#30721;'</span>
Traceback (most recent call last):
  File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1, <span style="font-weight: bold;">in</span> &lt;module&gt;
<span style="font-weight: bold; text-decoration: underline;">UnicodeDecodeError</span>: <span style="font-style: italic;">'ascii'</span> codec can<span style="font-style: italic;">'t decode byte 0xb1 in position 0: ordinal not in range(128)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org126bb13" class="outline-2">
<h2 id="org126bb13"><span class="section-number-2">4</span> Python3</h2>
<div class="outline-text-2" id="text-4">
<p>
和 <code>Python2</code> 中不同的是， <code>Python3</code> 默认的字符串类型变为了 <code>unicode</code>, 而字节字符串的定义需要通过 <code>b'abc'</code> 的方式。
</p>

<p>
这是一个坑， 很多时候， <code>Python2</code> 的程序中会存在类似 <code>str.decode()</code> 的代码， 然后到了 <code>Python3</code>, 你就会发现， <code>GG</code> 了。
</p>

<p>
<code>unicode</code> 是不存在 <code>decode</code> 方法的， <code>unicode</code> 很明显已经不能再解码了， 应该 <code>encode</code>.
</p>

<p>
同时， 不在对 <code>bytes</code> 和 <code>unicode</code> 进行隐式处理。
</p>

<p>
所以， 直接组合 <code>unicode</code> 和 <code>bytes</code> 将会报错。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'&#32534;&#30721;'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">type</span>(s)
&lt;<span style="font-weight: bold;">class</span> <span style="font-style: italic;">'str'</span>&gt;
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = u<span style="font-style: italic;">'&#32534;&#30721;'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">type</span>(s)
&lt;<span style="font-weight: bold;">class</span> <span style="font-style: italic;">'str'</span>&gt;
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = b<span style="font-style: italic;">'&#32534;&#30721;'</span>
  File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1
<span style="font-weight: bold; text-decoration: underline;">SyntaxError</span>: <span style="font-weight: bold;">bytes</span> can only contain ASCII literal characters.
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'&#32534;&#30721;'</span>.encode(<span style="font-style: italic;">'cp936'</span>)
&gt;&gt;&gt; s
b<span style="font-style: italic;">'\xb1\xe0\xc2\xeb'</span>
&gt;&gt;&gt; <span style="font-weight: bold;">type</span>(s)
&lt;<span style="font-weight: bold;">class</span> <span style="font-style: italic;">'bytes'</span>&gt;
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'&#32534;&#30721;'</span>.decode(<span style="font-style: italic;">'cp936'</span>)
Traceback (most recent call last):
  File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1, <span style="font-weight: bold;">in</span> &lt;module&gt;
<span style="font-weight: bold; text-decoration: underline;">AttributeError</span>: <span style="font-style: italic;">'str'</span> <span style="font-weight: bold;">object</span> has no attribute <span style="font-style: italic;">'decode'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org90ac413" class="outline-2">
<h2 id="org90ac413"><span class="section-number-2">5</span> 编写程序</h2>
<div class="outline-text-2" id="text-5">
<p>
<b>无法改变的五个事实：</b>
</p>
<ol class="org-ol">
<li>程序的所有输入输出均为 <code>byte(二进制数据)</code></li>
<li>世界上的文本需要比 <code>256</code> 更多的符号来表现</li>
<li>你的程序必须处理 <code>byte</code> 和 <code>unicode</code></li>
<li><code>byte</code> 流中不会包含编码信息</li>
<li>指明的编码有可能是错误的</li>
</ol>

<p>
<b>编程建议：</b>
</p>
<ol class="org-ol">
<li><code>Unicode</code> 三明治： 尽可能的让程序处理的文本都为 <code>Unicode</code></li>
<li>了解程序中的字符串， 哪些是 <code>unicode</code>, 哪些是 <code>byte</code>, 对于这些 <code>byte</code> 串，知道他们的编码是什么</li>
<li>测试 <code>Unicode</code> 支持。使用一些奇怪的符号来测试是否已经做到了以上几点</li>
</ol>
</div>
</div>

<div id="outline-container-orge7f8db2" class="outline-2">
<h2 id="orge7f8db2"><span class="section-number-2">6</span> 代码样例</h2>
<div class="outline-text-2" id="text-6">
<p>
在阅读 <a href="https://github.com/webpy/webpy">webpy</a> 源码的过程中， 发现了在 <code>utils.py</code> 中的一段处理这个问题的代码， 感觉很有用：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">safeunicode</span>(obj, encoding=<span style="font-style: italic;">'utf-8'</span>):
    r<span style="font-style: italic;">"""</span>
<span style="font-style: italic;">    Converts any given object to unicode string.</span>

<span style="font-style: italic;">        &gt;&gt;&gt; safeunicode('hello')</span>
<span style="font-style: italic;">        u'hello'</span>
<span style="font-style: italic;">        &gt;&gt;&gt; safeunicode(2)</span>
<span style="font-style: italic;">        u'2'</span>
<span style="font-style: italic;">        &gt;&gt;&gt; safeunicode('\xe1\x88\xb4')</span>
<span style="font-style: italic;">        u'\u1234'</span>
<span style="font-style: italic;">    """</span>
    <span style="font-weight: bold; font-style: italic;">t</span> = <span style="font-weight: bold;">type</span>(obj)
    <span style="font-weight: bold;">if</span> t <span style="font-weight: bold;">is</span> text_type:
        <span style="font-weight: bold;">return</span> obj
    <span style="font-weight: bold;">elif</span> t <span style="font-weight: bold;">is</span> <span style="font-weight: bold;">bytes</span>:
        <span style="font-weight: bold;">return</span> obj.decode(encoding)
    <span style="font-weight: bold;">elif</span> t <span style="font-weight: bold;">in</span> [<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">float</span>, <span style="font-weight: bold;">bool</span>]:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">unicode</span>(obj)
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">elif hasattr(obj, '__unicode__') or isinstance(obj, unicode):</span>
    <span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">return unicode(obj)</span>
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">else:</span>
    <span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">return str(obj).decode(encoding)</span>
    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">unicode</span>(obj)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">safestr</span>(obj, encoding=<span style="font-style: italic;">'utf-8'</span>):
    r<span style="font-style: italic;">"""</span>
<span style="font-style: italic;">    Converts any given object to utf-8 encoded string. </span>

<span style="font-style: italic;">        &gt;&gt;&gt; safestr('hello')</span>
<span style="font-style: italic;">        'hello'</span>
<span style="font-style: italic;">        &gt;&gt;&gt; safestr(2)</span>
<span style="font-style: italic;">        '2'</span>
<span style="font-style: italic;">    """</span>

    <span style="font-weight: bold;">if</span> PY2 <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(obj, <span style="font-weight: bold;">unicode</span>):
        <span style="font-weight: bold;">return</span> obj.encode(encoding)
    <span style="font-weight: bold;">elif</span> is_iter(obj):
        <span style="font-weight: bold;">return</span> imap(safestr, obj)
    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">str</span>(obj)

<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> PY2:
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">Since Python3, utf-8 encoded strings and unicode strings are the same thing</span>
    <span style="font-weight: bold; font-style: italic;">safeunicode</span> = safestr
</pre>
</div>

<p>
笔记链接： <a href="https://github.com/rgb-24bit/read-source-code/blob/master/webpy/utils.org#function-safeunicode">function safeunicode</a>
</p>
</div>
</div>

<div id="outline-container-org75cabab" class="outline-2">
<h2 id="org75cabab"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="http://pycoders-weekly-chinese.readthedocs.io/en/latest/issue5/unipain.html">unicode 之痛</a> - 推荐</li>
<li><a href="http://www.ruanyifeng.com/blog/2007/10/ascii_unicode_and_utf-8.html">字符编码笔记：ASCII，Unicode 和 UTF-8</a> - 阮一峰</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
